app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", nil]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      #check for artist id and filter
      @artist = Artist.find_by(id: params[:artist_id])
      if @artist
        @songs = Song.where(artist_id: params[:artist_id])
      elsif !@artist
        flash[:alert] = "Artist not found"
        redirect_to artists_path
      end
    else
      #if no artist_id return all songs
      @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if params[:artist_id]
      @artist = Artist.find_by(params[:artist_id])
      @song = @artist.songs.find_by(id: params[:id])